### Customer Segmentation & Sales Intelligence System

##### Importing libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

##### Reading the Dataset

In [2]:
df = pd.read_csv("OnlineRetail.csv", encoding='ISO-8859-1', low_memory=False)

df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

##### Inspecting the data

In [3]:
df.shape

(541909, 8)

In [4]:
df.columns

Index(['InvoiceNo', 'StockCode', 'Description', 'Quantity', 'InvoiceDate',
       'UnitPrice', 'CustomerID', 'Country'],
      dtype='object')

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  object
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 33.1+ MB

In [6]:
df.isnull().sum()

InvoiceNo           0
StockCode           0
Description      1454
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     135080
Country             0
dtype: int64

In [7]:
df.describe()

            Quantity      UnitPrice     CustomerID
count  541909.000000  541909.000000  406829.000000
mean        9.552250       4.611114   15287.690570
std       218.081158      96.759853    1713.600303
min    -80995.000000  -11062.060000   12346.000000
25%         1.000000       1.250000   13953.000000
50%         3.000000       2.080000   15152.000000
75%        10.000000       4.130000   16791.000000
max     80995.000000   38970.000000   18287.000000

##### Dropping the custID columns which are null or na

In [8]:
df = df.dropna(subset=['CustomerID'])

In [9]:
df.shape

(406829, 8)

##### Removing Cancelled orders

In [10]:
df = df[~df['InvoiceNo'].astype(str).str.startswith('C')]

In [11]:
df.shape

(397924, 8)

##### Removing negative or zero quantity

In [12]:
df=df[df['Quantity']>0]

In [13]:
df.shape

(397924, 8)

##### Removing Negative or Zero Price

In [14]:
df = df[df['UnitPrice']>0]
df.shape

(397884, 8)

##### Convert Date to Datetime

In [15]:
df['InvoiceDate'] = pd.to_datetime(df['InvoiceDate'])

##### Create Revenue Column

In [16]:
df['Revenue'] = df['Quantity'] * df['UnitPrice']

In [17]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Revenue
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34

In [18]:

df.isnull().sum()

InvoiceNo      0
StockCode      0
Description    0
Quantity       0
InvoiceDate    0
UnitPrice      0
CustomerID     0
Country        0
Revenue        0
dtype: int64

In [19]:
df.describe()

,Quantity,InvoiceDate,UnitPrice,CustomerID,Revenue
count,397884.000000,397884,397884.000000,397884.000000,397884.000000
mean,12.988238,2011-07-10 23:41:23.511023360,3.116488,15294.423453,22.397000
min,1.000000,2010-12-01 08:26:00,0.001000,12346.000000,0.001000
25%,2.000000,2011-04-07 11:12:00,1.250000,13969.000000,4.680000
50%,6.000000,2011-07-31 14:39:00,1.950000,15159.000000,11.800000
75%,12.000000,2011-10-20 14:33:00,3.750000,16795.000000,19.800000
max,80995.000000,2011-12-09 12:50:00,8142.750000,18287.000000,168469.600000
std,179.331775,NaN,22.097877,1713.141560,309.071041

In [20]:
df.shape

(397884, 9)

In [21]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Revenue
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34

#### RFM Analysis

##### create snapshot date

In [22]:
snapshot_date = df['InvoiceDate'].max() + pd.Timedelta(days=1)
snapshot_date

Timestamp('2011-12-10 12:50:00')

##### Create RFM Metrics

In [23]:
rfm = df.groupby('CustomerID').agg({'InvoiceDate': lambda x: (snapshot_date - x.max()).days, 'InvoiceNo': 'nunique','Revenue': 'sum'})

##### rename columns

In [24]:
rfm.columns = ['Recency', 'Frequency', 'Monetary']
rfm.head()

            Recency  Frequency  Monetary
CustomerID
12346.0         326          1  77183.60
12347.0           2          7   4310.00
12348.0          75          4   1797.24
12349.0          19          1   1757.55
12350.0         310          1    334.40

In [25]:
rfm.describe()

           Recency    Frequency       Monetary
count  4338.000000  4338.000000    4338.000000
mean     92.536422     4.272015    2054.266460
std     100.014169     7.697998    8989.230441
min       1.000000     1.000000       3.750000
25%      18.000000     1.000000     307.415000
50%      51.000000     2.000000     674.485000
75%     142.000000     5.000000    1661.740000
max     374.000000   209.000000  280206.020000

#### RFM Scoring (Quantile Based)

##### for recency (the lower the better)

In [26]:
rfm['R_score'] = pd.qcut(rfm['Recency'], 4, labels=[4,3,2,1])

##### for frequency (the higher the better)

In [27]:
rfm['F_score'] = pd.qcut(rfm['Frequency'].rank(method='first'), 4, labels=[1,2,3,4])

##### for monetary (the higher the better)

In [28]:
rfm['M_score'] = pd.qcut(rfm['Monetary'], 4, labels=[1,2,3,4])

In [29]:
rfm.head()

            Recency  Frequency  Monetary R_score F_score M_score
CustomerID
12346.0         326          1  77183.60       1       1       4
12347.0           2          7   4310.00       4       4       4
12348.0          75          4   1797.24       2       3       4
12349.0          19          1   1757.55       3       1       4
12350.0         310          1    334.40       1       1       2

##### combine score

In [30]:
rfm['RFM_Score'] = (rfm['R_score'].astype(str) + rfm['F_score'].astype(str) + rfm['M_score'].astype(str))
rfm.head()

            Recency  Frequency  Monetary R_score F_score M_score RFM_Score
CustomerID
12346.0         326          1  77183.60       1       1       4       114
12347.0           2          7   4310.00       4       4       4       444
12348.0          75          4   1797.24       2       3       4       234
12349.0          19          1   1757.55       3       1       4       314
12350.0         310          1    334.40       1       1       2       112

#### Customer Segmentation

In [31]:
rfm['R_score'] = rfm['R_score'].astype(int)
rfm['F_score'] = rfm['F_score'].astype(int)
rfm['M_score'] = rfm['M_score'].astype(int)

In [32]:
def segment_customer(row):
    if row['R_score'] == 4 and row['F_score'] == 4:
        return 'Champions'
    elif row['R_score'] >= 3 and row['F_score'] >= 3:
        return 'Loyal Customers'
    elif row['R_score'] == 4:
        return 'Recent Customers'
    elif row['F_score'] == 4:
        return 'Frequent Customers'
    elif row['R_score'] == 1:
        return 'At Risk'
    else:
        return 'Others'

In [33]:
rfm['Segment'] = rfm.apply(segment_customer, axis=1)

In [34]:
rfm['Segment'].value_counts()

Segment
Others                1351
At Risk               1056
Loyal Customers        914
Champions              609
Recent Customers       234
Frequent Customers     174
Name: count, dtype: int64

##### Revenue Contribution per Segment

In [35]:
segment_revenue = rfm.groupby('Segment')['Monetary'].sum().sort_values(ascending=False)
segment_revenue

Segment
Champions             4578426.310
Loyal Customers       2022948.841
Others                 937949.602
At Risk                644844.131
Frequent Customers     439564.450
Recent Customers       287674.570
Name: Monetary, dtype: float64

In [36]:
segment_revenue_percentage = segment_revenue / segment_revenue.sum() * 100
segment_revenue_percentage

Segment
Champions             51.377138
Loyal Customers       22.700665
Others                10.525268
At Risk                7.236164
Frequent Customers     4.932604
Recent Customers       3.228161
Name: Monetary, dtype: float64

##### identifying VIP customers

In [37]:
rfm.sort_values('Monetary', ascending=False).head(10)

,Recency,Frequency,Monetary,R_score,F_score,M_score,RFM_Score,Segment
CustomerID,,,,,,,,
14646.0,2,73,280206.02,4,4,4,444,Champions
18102.0,1,60,259657.30,4,4,4,444,Champions
17450.0,8,46,194550.79,4,4,4,444,Champions
16446.0,1,2,168472.50,4,2,4,424,Recent Customers
14911.0,1,201,143825.06,4,4,4,444,Champions
12415.0,24,21,124914.53,3,4,4,344,Loyal Customers
14156.0,10,55,117379.63,4,4,4,444,Champions
17511.0,3,31,91062.38,4,4,4,444,Champions
16029.0,39,63,81024.84,3,4,4,344,Loyal Customers
12346.0,326,1,77183.60,1,1,4,114,At Risk

#### Segment-Level Business Insights

##### Count Customers per Segment

In [38]:
rfm['Segment'].value_counts()

Segment
Others                1351
At Risk               1056
Loyal Customers        914
Champions              609
Recent Customers       234
Frequent Customers     174
Name: count, dtype: int64

##### Revenue per Segment

In [42]:
segment_summary = rfm.groupby('Segment').agg({'Recency': 'count','Monetary': 'sum'}).rename(columns={'Recency': 'Customer_Count'}).sort_values(by='Monetary', ascending=False)
segment_summary

                    Customer_Count     Monetary
Segment
Champions                      609  4578426.310
Loyal Customers                914  2022948.841
Others                        1351   937949.602
At Risk                       1056   644844.131
Frequent Customers             174   439564.450
Recent Customers               234   287674.570

##### revenue percentage

In [43]:
segment_summary['Revenue_%'] = (segment_summary['Monetary']/segment_summary['Monetary'].sum()) * 100
segment_summary

                    Customer_Count     Monetary  Revenue_%
Segment
Champions                      609  4578426.310  51.377138
Loyal Customers                914  2022948.841  22.700665
Others                        1351   937949.602  10.525268
At Risk                       1056   644844.131   7.236164
Frequent Customers             174   439564.450   4.932604
Recent Customers               234   287674.570   3.228161